// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
Console.Write("Введите  число >");
string nam1 = Console.ReadLine();
int nam2 = Convert.ToInt32(nam1);

Console.Write(nam2 * nam2);
