// 3. Напишите программу вычисления функции:
//  x = f(a)

Console.Write("Введите начение f>");
string а = Console.ReadLine();
int nam1 = Convert.ToInt32(а);

Console.Write("Введите начение a>");
string b = Console.ReadLine();
int nam2 = Convert.ToInt32(b);

Console.Write(nam2*nam1);